Revit 2026 API

# ConnectorElementChangeHostReference(Reference) Method

---

Changes the connector host reference to a new planar face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ChangeHostReference(
	Reference planarFace
)
```
```vb
Public Sub ChangeHostReference (
	planarFace As Reference
)
```
```cpp
public:
void ChangeHostReference(
	Reference^ planarFace
)
```
```fsharp
member ChangeHostReference :
        planarFace : Reference -> unit
```

#### Parameters

planarFace Reference
     The planar face to place the connector on.

| Exception | Condition |
| --- | --- |
| ArgumentException | The face is not a planar face. |
| ArgumentNullException | A non-optional argument was null |

The connector referenced by a planar face alone is placed at the plane origin, and may be moved later along the planar face.

#### Reference

ConnectorElement Class

ChangeHostReference Overload

Autodesk.Revit.DB Namespace